Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: You can use this function to check and see if the calling instance would collide with any instance flagged as solid in your game.
zh_cn: 您可以使用此函数来检查并查看调用实例是否会与游戏中标记为实体的任何实例发生碰撞。

source: You can use this function to check and see if the calling instance would collide with any other instance of an object or all instances in your game.
zh_cn: 你可以使用此函数来检查和查看调用实例是否会与一个对象的任何其他实例或者游戏中的所有实例发生碰撞。

source: You can use this function to check if the device is paused or not.
zh_cn: 您可以通过此函数检查设备是否暂停。

source: You can use this function to check the attributes of a given file.
zh_cn: 您可以使用此函数来检查给定文件的属性。

source: You can use this function to copy the contents of one map into another one that you have previously created using ds_map_create().
zh_cn: 您可以使用此函数将一个map的内容复制到前面使用ds_map_create()创建的另一个中。

source: You can use this function to destroy the indicated mp_grid (as defined by the function mp_grid_create()) and free up the memory allocated it.
zh_cn: 您可以使用此函数来销毁指定的mp_grid(由函数mp_grid_create()定义)并释放分配给它的内存。

source: You can use this function to enable or disable the automatic drawing of the application surface.
zh_cn: 您可以使用此函数来启用或禁用应用程序表面的自动绘制。

source: You can use this function to find the current value for the alpha test reference (default is 0, but you can use gpu_set_alphatestref() to set this value to something other than this).
zh_cn: 您可以使用此函数来查找alpha测试引用的当前值(默认值为0，但您可以使用gpu_set_alphatestref()将此值设置为除此之外的值)。

source: You can use this function to find the status of the keypad number lock with true being returned for on, and false returned for off.
zh_cn: 您可以使用此函数查找键盘号码锁的状态，打开返回true，关闭返回false。

source: You can use this function to get or to set the speed of a path after it has been started using the function path_start().
zh_cn: 在使用函数path_start()启动路径后，可以使用此函数获取或设置路径的速度。

source: You can use this function to get the IDs of all layers assigned a specific depth.
zh_cn: 你可以使用此函数来获取指定深度的所有层的id。

source: You can use this function to get the Layer ID that the given element is on.
zh_cn: 你可以使用此函数来获取给定元素所在的图层ID。

source: You can use this function to get the depth value associated with a given layer.
zh_cn: 您可以使用此函数来获取与给定层相关的深度值。

source: You can use this function to get the element IDs of the given layer.
zh_cn: 你可以使用此函数来获取给定层的元素id。

source: You can use this function to get the element type for the given element.
zh_cn: 可以使用此函数获取给定元素的元素类型。

source: You can use this function to get the exact length of a path in pixels.
zh_cn: 您可以使用此函数来获得路径的精确长度(以像素为单位)。

source: You can use this function to get the name of the given layer.
zh_cn: 你可以使用此函数来获取给定层的名称。

source: You can use this function to get the unique identifying index for a game asset from its name.
zh_cn: 你可以使用此函数从名称中获取游戏资源的唯一标识索引。

source: You can use this function to get the value of the different axes from a given gamepad slot.
zh_cn: 你可以使用此函数从一个给定的游戏手柄插槽中获取不同轴的值。

source: You can use this function to move an element from one layer to another.
zh_cn: 您可以使用此函数将元素从一层移动到另一层。

source: You can use this function to optimise your game for devices as the lower the number of channels for audio the better the performance, but bear in mind that this may also cause noticeable cut off of certain sounds if many are played at once.
zh_cn: 你可以通过此函数针对设备优化游戏，因为音频通道数量越少，性能越好，但请记住，如果同时播放多个音频，这也可能导致某些声音明显中断。

source: You can use this function to parse a given string and get any numbers from it.
zh_cn: 您可以使用此函数解析给定的字符串并从中获取任意数字。

source: You can use this function to parse a string looking for a specific part, which can then be replaced by the new string that you have specified.
zh_cn: 您可以使用此函数解析字符串，查找特定的部分，然后可以用您指定的新字符串替换该部分。

source: You can use this function to parse a string looking for specific parts, which can then be replaced by the new string that you have specified in all places that they occur.
zh_cn: 您可以使用此函数解析字符串，查找特定的部分，然后可以在它们出现的所有位置用您指定的新字符串替换这些部分。

source: You can use this function to read a number from an ini data file.
zh_cn: 您可以使用此函数从ini数据文件中读取一个数字。

source: You can use this function to read a string (text) from an ini data file.
zh_cn: 您可以使用此函数从 ini 数据文件中读取字符串（文本）。

source: You can use this function to remove a specific part of a string.
zh_cn: 您可以使用此函数来移除字符串的特定部分。

source: You can use this function to retrieve the horizontal speed (in pixels per game frame) of the layer within the currently scoped room.
zh_cn: 你可以使用此函数来检索当前房间范围内的层的水平速度(以像素为单位)。

source: You can use this function to retrieve the vertical speed (in pixels per game frame) of the layer within the currently scoped room.
zh_cn: 您可以使用此函数来检索当前范围内房间的层的垂直速度(以每游戏帧的像素为单位)。

source: You can use this function to retrieve the x position of the layer within the currently scoped room.
zh_cn: 您可以使用此函数来检索当前范围内的房间中的层的x位置。

source: You can use this function to retrieve the y position of the layer within the currently scoped room.
zh_cn: 您可以使用此函数来检索当前范围房间内的层的y位置。

source: You can use this function to return a specific character at a specific position within a string, with the index starting at 1 for the first character.
zh_cn: 您可以使用此函数返回字符串中特定位置的特定字符，第一个字符的索引从1开始。

source: You can use this function to return a specific character code at a specific position within a string, with the index starting at 1 for the first character.
zh_cn: 您可以使用此函数在字符串中的特定位置返回特定的字符代码，其中第一个字符的索引从1开始。

source: You can use this function to rotate a given path around its center.
zh_cn: 您可以使用此函数将给定的路径绕其中心旋转。

source: You can use this function to send your achievements to the chosen leaderboard and achievement service.
zh_cn: 您可以通过此函数将您的成就发送到所选的排行榜和成就服务。

source: You can use this function to send your score to the chosen leaderboard and achievement service.
zh_cn: 你可以使用此函数发送你的分数到选择的排行榜和成就服务。

source: You can use this function to set the follow border of the view camera within the room.
zh_cn: 您可以使用此函数来设置房间内视图相机的跟随边界。

source: You can use this function to set the follow target of the view camera within the room.
zh_cn: 您可以通过此函数设置房间内查看相机的跟随目标。

source: You can use this function to set the horizontal speed (in pixels per game frame) of the layer within the currently scoped room.
zh_cn: 您可以使用此函数来设置当前范围房间内的层的水平速度(以每游戏帧像素为单位)。

source: You can use this function to set the vertical speed (in pixels per game frame) of the layer within the currently scoped room.
zh_cn: 你可以使用此函数来设置当前房间范围内图层的垂直速度(单位是像素/游戏帧)。

source: You can use this function to set the x position of the layer within the currently scoped room.
zh_cn: 你可以使用此函数在当前范围的房间内设置层的x位置。

source: You can use this function to set the y position of the layer within the currently scoped room.
zh_cn: 你可以使用此函数在当前范围的房间内设置层的y位置。

source: You can use this function to submit the contents of a vertex buffer to the graphics pipeline for use with a shader.
zh_cn: 您可以使用此函数将顶点缓冲区的内容提交到图形管道，以便与着色器一起使用。

source: You can use this function to switch the keypad number-lock on or off (set to true for on, and false for off).
zh_cn: 您可以通过此函数来切换键盘数字锁的开启或关闭(设置为true为开启，false为关闭)。

source: You can use this function to switch the player from the foreground layer to the background layer and make it appear behind the other layers being drawn.
zh_cn: 您可以通过此函数将播放器从前景层切换到背景层，并使其出现在正在绘制的其他层的后面。

source: You can use this function to update the angle of the view camera within the room.
zh_cn: 您可以通过此函数更新房间内的视角相机的角度。

source: You can use this function to update the position of the camera view within the room.
zh_cn: 你可以使用此函数来更新房间内摄像头视图的位置。

source: You can use this function to update the size of the view camera within the room.
zh_cn: 您可以通过此函数来更新房间内视图相机的大小。

source: You can use this function to update the speed of the view camera within the room.
zh_cn: 您可以通过此函数来更新房间内查看相机的速度。

source: You can use this function to write a string (text) to an ini data file.
zh_cn: 您可以使用此函数将字符串（文本）写入 ini 数据文件。

source: You can use this function to write a value (numeric) to an ini data file.
zh_cn: 您可以使用此函数将值（数字）写入 ini 数据文件。

source: You can use this id to get the density value of the bound fixture (not the "base" fixture) at any time using this function.
zh_cn: 您可以使用这个id在任何时候使用此函数来获得绑定夹具(而不是"基础"夹具)的密度值。

source: You can use this id to get the restitution (the "bounciness" property) value of the bound fixture, not the "base" fixture, at any time using this function.
zh_cn: 您可以使用此ID随时使用此函数获取绑定固定装置的恢复（"弹性"属性）值，而不是"基本"固定装置。

source: You can use this id to set the density value of the bound fixture, not the "base" fixture, at any time using this function.
zh_cn: 您可以在任何时候使用这个id来设置绑定夹具的密度值，而不是"基础"夹具。

source: You can use this id to set the friction value of the bound fixture, not the "base" fixture, at any time using this function.
zh_cn: 您可以在任何时候使用这个id来设置绑定夹具(而不是"基础"夹具)的摩擦值。

source: You can use this id to set the restitution value of the bound fixture, not the "base" fixture, at any time using this function.
zh_cn: 您可以随时通过此函数，使用此id来设置绑定夹具的恢复值，而不是"基础"夹具的恢复值。

source: You can use this if you need a unique file name, or anything else that needs something to identify your game only.
zh_cn: 如果你需要一个唯一的文件名，或者其他需要识别游戏的东西，你可以使用这个。

source: You can use this to get the domain where your HTML5 game is being played.
zh_cn: 你可以使用它来获取正在玩HTML5游戏的域。

source: You can, however, use this string to get the font index using the returned string along with the function asset_get_index().
zh_cn: 但是，您可以使用这个字符串使用返回的字符串和asset_get_index()函数来获取字体索引。

source: You can, however, use this string to get the object index using the returned string along with the function asset_get_index().
zh_cn: 但是，您可以使用这个字符串通过返回的字符串和asset_get_index()函数来获取对象索引。

source: You can, however, use this string to get the path index ID using the returned string along with the function asset_get_index().
zh_cn: 但是，您可以使用这个字符串，通过使用返回的字符串和函数asset_get_index()来获取路径索引ID。

source: You can, however, use this string to get the room index using the returned string along with the function asset_get_index().
zh_cn: 但是，您可以使用这个字符串，使用返回的字符串和asset_get_index()函数来获取房间索引。

source: You can, however, use this string to get the sprite index using the returned string along with the function asset_get_index().
zh_cn: 但是，您可以使用该字符串，通过使用返回的字符串和函数asset_get_index()来获取sprite索引。

source: You can, however, use this string to get the tile set index using the returned string along with the function asset_get_index().
zh_cn: 但是，您可以使用此字符串，通过使用返回的字符串和函数asset_get_index()来获取图块集索引。

source: You can, however, use this string to get the timeline index using the returned string along with the function asset_get_index().
zh_cn: 但是，您可以使用该字符串，通过使用返回的字符串和函数asset_get_index()来获取时间轴索引。

source: You create a DS list and supply its ID along with an x/y position to check and the list will be populated with name string for each of the available attachment slots for the sprite (including any attachment modifications).
zh_cn: 您创建一个DS列表，并提供它的ID和一个x/y位置来检查，该列表将用sprite的每个可用附件插槽的名称字符串填充(包括任何附件修改)。

source: You define the point in the room where the joint should be created, as well as the angle that you wish the joint to try and maintain at all times, as shown in the image below:
zh_cn: 你在房间中定义关节应该创建的点，以及你希望关节尝试并始终保持的角度，如下图所示:

source: You give the DS grid index (as returned by ds_grid_create()) along with the x/y positions for the center cell of the disk.
zh_cn: 给出DS网格索引(由ds_grid_create()返回)以及磁盘中心单元的x/y位置。

source: You give the DS grid index (as returned by ds_grid_create()) along with the x/y positions for the top left and bottom right corners of the grid region to search, before supplying the value to search for.
zh_cn: 在提供要搜索的值之前，需要给出DS网格索引(由ds_grid_create()返回)以及要搜索的网格区域左上角和右下角的x/y位置。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return a real value that represents the sprite index being shown.
zh_cn: 给定背景元素ID(在使用layer_background_create()创建背景元素或使用函数layer_background_get_id()时获得)，此函数将返回一个表示所显示的sprite索引的真实值。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return a value between 0 (fully transparent) and 1 (fully opaque).
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，函数将返回一个介于0(完全透明)和1(完全不透明)之间的值。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return either true if the element is currently tiled, or false if it is not.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建一个背景元素时得到)，如果元素当前是平铺的，函数将返回true，如果不是，则返回false。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return either true if the element is currently visible, or false if it is not.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，如果元素当前可见，此函数将返回true，如果不可见，则返回false。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return either true if the element sprite is currently stretched to fit the room, or false if it is not.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，如果精灵元素当前被拉伸以适应房间，此函数将返回true，如果不是，则返回false。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return real value that represents the colour assigned.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，函数将返回代表分配的颜色的真实值。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return real value that represents the image index being shown for the sprite.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，函数将返回真实值，表示为精灵显示的图像索引。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return real value that represents the scale multiplier being used to draw the sprite.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，函数将返回代表用于绘制精灵的缩放倍数值。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and the function will return real value that represents the speed multiplier being used to animate the sprite.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，函数将返回代表用于动画精灵的速度乘数的真实值。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the alpha value to use.
zh_cn: 给出背景元素ID(使用layer_background_create()创建背景元素或使用layer_background_get_id()函数时获得)，然后设置要使用的透明度(alpha)值。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the animation speed.
zh_cn: 给出背景元素ID(使用layer_background_create()创建背景元素时获得，或者使用layer_background_get_id()函数获得)，然后设置动画速度。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the blending colour to use.
zh_cn: 给出背景元素ID(使用layer_background_create()创建背景元素或使用layer_background_get_id()函数时获得)，然后设置要使用的混合颜色。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the image index to use.
zh_cn: 你给出背景元素ID(当你使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，然后设置图像索引为use。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the scale value.
zh_cn: 给出背景元素ID(当使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，然后设置缩放值。

source: You give the background element ID (which you get when you create a background element using layer_background_create() or when you use the function layer_background_get_id()), and then set the tiling value.
zh_cn: 给出背景元素ID(当使用layer_background_create()或使用layer_background_get_id()函数创建背景元素时获得)，然后设置平铺值。

source: You give the constant that refers to the mip filtering mode that you require, where you can choose between point filtering (default setting, meaning no filtering), linear filtering (this is also known as trilinear filtering) or aniostropic filtering (see the constants table below).
zh_cn: 您可以给出所需mip过滤模式的常量，您可以在点过滤(默认设置，表示无过滤)、线性过滤(也称为三线性过滤)或无向性过滤(见下表常量)之间进行选择。

source: You give the depth to check and the function will return an array with 1 or more entries depending on whether there are any layers at the given depth or not.
zh_cn: 给定检查的深度，函数将返回一个包含1个或多个条目的数组，这取决于给定深度是否有任何层。

source: You give the element ID, as returned by the function used to create the element or the room editor or the function layer_get_all_elements(), and then you give the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact).
zh_cn: 你给出元素ID，就像创建元素的函数或房间编辑器或函数layer_get_all_elements()返回的那样，然后给出层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这会影响性能)。

source: You give the id of the previously created buffer to load into, then the saved buffer file to load, and finally the offset from the start of the buffer (in bytes) that you wish to load the data to.
zh_cn: 您给出了要加载到的先前创建的缓冲区的id，然后是要加载的保存的缓冲区文件，最后是要加载数据的缓冲区起始位置的偏移量(以字节为单位)。

source: You give the id of the previously created buffer to load into, then the saved buffer file to load, and then the offset from the start of the buffer (in bytes) that you wish to load the data from.
zh_cn: 您给出要加载到的先前创建的缓冲区的id，然后是要加载的保存的缓冲区文件，然后是从您希望加载数据的缓冲区开始的偏移量(以字节为单位)。

source: You give the index in the instance list to get the ID from and the function will return the value for storing in a variable.
zh_cn: 您在实例列表中给出索引以从中获取ID，函数将返回存储在变量中的值。

source: You give the instance element ID (see the code example below for how to get this), and the function will return a real value that represents the unique instance id for the element.
zh_cn: 您给出实例元素id(参见下面的代码示例，了解如何获得ID)，函数将返回一个真实的值，表示元素的惟一实例ID。

source: You give the list ID (as returned when you created the list) and the position within the list to set as well as the value to set it to.
zh_cn: 您给出列表ID(创建列表时返回的ID)和要设置的列表中的位置，以及要设置的值。

source: You give the room ID and the index of the view port to retrieve (from 0 to 7) and the function will return an array of 5 indices, where:
zh_cn: 你给出要检索的视图端口的房间ID和索引(从0到7)，函数将返回一个包含5个索引的数组，其中:

source: You give the room to use, the view port to use (from 0 to 7) and the function will return a camera index.
zh_cn: 你给出要使用的房间，要使用的视图端口(从0到7)，函数将返回一个相机索引。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return a real value that represents the sprite index being shown.
zh_cn: 给定sprite元素ID(使用layer_sprite_create()创建sprite元素或使用layer_sprite_get_id()函数时获得)，函数将返回一个表示所显示的sprite索引的实数值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return a value between 0 (fully transparent) and 1 (fully opaque).
zh_cn: 你给出精灵元素ID(当你使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，函数将返回0(完全透明)和1(完全不透明)之间的值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return real value for the angle.
zh_cn: 你给出精灵元素ID(当你使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，函数将返回角度的真实值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return real value for the x scale, where 1 is no scaling.
zh_cn: 给定sprite元素ID(使用layer_sprite_create()创建sprite元素或使用layer_sprite_get_id()函数时获得)，函数将返回 x 轴的缩放值，其中1表示无缩放。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return real value for the y scale, where 1 is no scaling.
zh_cn: 给定sprite元素ID(在使用layer_sprite_create()创建sprite元素或使用函数layer_sprite_get_id()时获得)，函数将返回 y 轴缩放值，其中1表示无缩放。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return real value that represents the colour assigned.
zh_cn: 你给出精灵元素ID(当你使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，函数将返回代表所分配颜色的真实值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return real value that represents the image index being shown for the sprite.
zh_cn: 你给出精灵元素ID(当你使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，函数将返回代表精灵显示的图像索引的真实值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return real value that represents the speed multiplier being used to animate the sprite.
zh_cn: 你给出精灵元素ID(当你使用layer_sprite_create()或使用layer_sprite_get_id()函数创建精灵元素时获得)，函数将返回代表用于动画精灵的速度乘数的真实值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return the x position value.
zh_cn: 给定sprite元素ID(在使用layer_sprite_create()创建sprite元素或使用函数layer_sprite_get_id()时获得)，函数将返回x位置值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and the function will return the y position value.
zh_cn: 给定sprite元素ID(使用layer_sprite_create()创建sprite元素或使用layer_sprite_get_id()函数时获得)，函数将返回y位置值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the alpha value to use.
zh_cn: 你可以给出精灵元素ID(当你使用layer_sprite_create()或layer_sprite_get_id()函数创建精灵元素时获得)，然后设置透明度(Alpha)值。

source: You give the sprite element ID (which you get when you create a sprite element using layer_sprite_create() or when you use the function layer_sprite_get_id()), and then set the angle value, from 0 to 359 anti-clockwise, where 0 is to the right, 90 is to the top, 180 is to the left and 270 is to the bottom.
zh_cn: 你可以给出精灵元素ID(当你使用layer_sprite_create()或layer_sprite_get_id()函数创建精灵元素时获得)，然后设置角度值，从逆时针方向从0到359，其中0代表右，90代表上，180代表左，270代表下。
